read_verilog registro_4yosys.v
hierarchy -check -top registro_4yosys
proc; opt; fsm; opt; memory; opt
techmap; opt
abc -liberty cmos_cells.lib
show -lib cmos_cells.v
clean
write_verilog -noattr synth.v
