read_verilog registro_cond.v
hierarchy -check -top registro_cond
proc; opt; fsm; opt; memory; opt
techmap; opt
abc -liberty cmos_cells.lib
show -lib cmos_cells_delay.v
clean
write_verilog -noattr synth_delay.v
