read_verilog registro_cond.v
hierarchy -check -top registro_cond
proc; opt; fsm; opt; memory; opt
techmap; opt
show
clean
write_verilog synthA.v
