read_verilog fifo_cond.v
hierarchy -check -top fifo_cond
proc; opt; fsm; opt; memory; opt
techmap; opt
abc -liberty cmos_cells.lib
show -lib cmos_cells.v -prefix fifo_synth -format eps
clean
write_verilog -noattr fifo_synth.v
