read_verilog memory_cond.v
hierarchy -check -top memory_cond
proc; opt; fsm; opt; memory; opt
techmap; opt
abc -liberty cmos_cells.lib
show -lib cmos_cells.v -prefix memory_synth -format eps
clean
write_verilog -noattr memory_synth.v
