read_verilog byte_joining_cond.v
hierarchy -check -top byte_joining_cond
proc;
opt;
fsm;
opt;
memory;
opt;
techmap;
opt;
write_verilog rtlil.v
dfflibmap -liberty cmos_cells.lib;
abc -liberty cmos_cells.lib;
clean
write_verilog sintetizado.v
