read_verilog byte_striping_synth.v
hierarchy -check -top byte_striping_synth
proc; opt; fsm; opt; memory; opt
techmap; opt
abc -liberty cmos_cells.lib
show -lib cmos_cells.v -prefix yosys_cmos_synth -format eps
clean
write_verilog -noattr yosys_cmos_synth.v
